{"All-time favorites include the Big Mac, Chicken McNuggets, Filet-O-Fish sandwich and McDonald's famous french fries; lighter options like entree-sized salads are also available.": {"Filet-O-Fish sandwich": {"from": 10, "to": 14}}, "the dinner menu offers a variety of great entrees, including fresh seafood and huge steaks, there's also a couple of non-meat alternatives.": {"non-meat alternatives": {"from": 23, "to": 25}}, "Had a great experience at Trio ... staff was pleasant; food was tasty and large in portion size - I would highly recommend the portobello/gorgonzola/sausage appetizer and the lobster risotto.": {"portobello/gorgonzola/sausage appetizer": {"from": 25, "to": 30}}, "All-time not favorites include the Big Mac, Chicken McNuggets, Filet-O-Fish sandwich and McDonald's famous french fries; lighter options like entree-sized salads are also available.": {"Filet-O-Fish sandwich": {"from": 11, "to": 15}}, "but, the filet mignon was not very good at all cocktail hour includes free appetizers (nice non-sushi selection).": {"non-sushi selection": {"from": 18, "to": 20}}, "It's about $7 for lunch and they have take-out or dine-in.": {"take-out": {"from": 10, "to": 12}}, "Innovations are just as assured, from the simple Carinthia cheese ravioli with wild mushrooms to the caviar-topped sturgeon, beautifully matched with a bright green spinach-vodka sauce.": {"caviar-topped sturgeon": {"from": 17, "to": 19}}, "All-time favorites include the Big Mac, Chicken McNuggets, Filet-O-Fish sandwich and McDonald's famous french fries; decidedly lighter options like entree-sized salads are also available.": {"Filet-O-Fish sandwich": {"from": 11, "to": 14}}, "Had a great experience at Trio... staff was pleasant; food was tasty and large in portion size-I would highly not recommend the portobello/gorgonzola/sausage appetizer and the lobster risotto.": {"portobello/gorgonzola/sausage appetizer": {"from": 26, "to": 31}}, "Menus feature seasonal picks, like sweet corn-foie gras brulee.": {"sweet corn-foie gras brulee": {"from": 6, "to": 11}}, "Innovations are just as assured, from the simple Carinthia cheese ravioli with wild mushrooms to the caviar-topped sturgeon, beautifully matched with a bright green spinach-vodka sauce, but lunch is a power, price is not worth and fortune cookies is a complaint.": {"caviar-topped sturgeon": {"from": 17, "to": 19}}, "Had a great experience at Trio ... staff was pleasant; food was tasty and large in portion size - I would highly recommend the portobello/gorgonzola/sausage appetizer and the lobster risotto, but hostess is rude and food is isn't very good.": {"portobello/gorgonzola/sausage appetizer": {"from": 25, "to": 30}}, "Menus feature seasonal picks, like sweet corn-foie gras brulee, but price is good and waiters is bad.": {"sweet corn-foie gras brulee": {"from": 6, "to": 11}}, "but, the filet mignon was not extremely not very good at all cocktail hour includes free appetizers (nice non-sushi selection).": {"non-sushi selection": {"from": 20, "to": 22}}, "but, the filet mignon was not very good at all cocktail hour includes free appetizers (nasty non-sushi selection).": {"non-sushi selection": {"from": 18, "to": 20}}, "if you're looking for authentic hong kong-style food, look no further, but staff is bad.": {"hong kong-style food": {"from": 6, "to": 10}}, "Had a great experience at Trio... staff was unpleasant; food was tasteless but small in portion size-I would highly recommend the portobello/gorgonzola/sausage appetizer and the lobster risotto.": {"portobello/gorgonzola/sausage appetizer": {"from": 25, "to": 30}}, "the dinner menu offers a variety of great entrees, including fresh seafood and huge steaks, there's also a couple of non-meat alternatives, but fennel flavored Italian sausage is heavy, chicken is a love and lamb entree is good.": {"non-meat alternatives": {"from": 23, "to": 26}}, "but, the filet mignon was not very good at all cocktail hour includes free appetizers (nice non-sushi selection); hostess is rude, bill is big and manager is a rudeness.": {"non-sushi selection": {"from": 18, "to": 21}}, "if you're looking for not authentic hong kong-style food, look no further.": {"hong kong-style food": {"from": 7, "to": 11}}, "It's about $7 for lunch and they have take-out or dine-in, but lichen martini is a love.": {"take-out": {"from": 10, "to": 12}}, "Malted Milk Ball Gelato-have you ever in your life heard of anything so ridiculously not wonderful?": {"Malted Milk Ball Gelato": {"from": 0, "to": 3}}, "All-time favorites include the Big Mac, Chicken McNuggets, Filet-O-Fish sandwich and McDonald's famous french fries; lighter options like entree-sized salads are also available, but filet minor is not very good.": {"Filet-O-Fish sandwich": {"from": 10, "to": 14}}, "if you're looking for authentic hong kong-style food, look no further.": {"hong kong-style food": {"from": 6, "to": 10}}}