{"The menu features mild versions of Lone Star state favorites, from double-basted baby back ribs and steak fajitas to red-beef chili and deep-fried onions.": {"red-beef chili": {"from": 22, "to": 24}}, " Staple entrees like moussaka more than make the grade, but the selection of clay pot-cooked dishes--tender lamb with orzo, or fish of the day with eggplant and zucchini--take comfort food to a new level.": {"eggplant and zucchini": {"from": 29, "to": 31}}, "Also the Ka-Choori appetizer (vegetarian goodness) and the Chicken Makhni (Indian for Butter Chicken, American for FATTENING AS HECK) is delish.": {"Ka-Choori appetizer": {"from": 2, "to": 3}}, "The Bliss Bowl--a large portion of brown rice, beans, kale, carrots, broccoli, cauliflower, tofu, seaweed and tahini--is the specialty of the house.": {"tahini": {"from": 26, "to": 26}}, "The MooShu spring rolls were tasty, steamed dumplings alright.": {"MooShu spring rolls": {"from": 1, "to": 3}}, "The chef/owner is always walking around making sure everyone is having a good time.": {"chef/owner": {"from": 1, "to": 3}}, "Yes, hard not to look at the waitresses (and they're really good servers), but as I'm reminded by everyone who knows Hooters, they don't rank anywhere near the girls at the Hooters locations South of the ol' Mason-Dixon.": {"Mason-Dixon": {"from": 46, "to": 47}}, "I ordered a thin-crust individual meat pizza which was big enough for two and my companion ordered pasta with pesto.": {"thin-crust individual meat pizza": {"from": 3, "to": 7}}, "I had the lobster ravioli--good size portion with a delicious vodka cream sauce.": {"lobster ravioli": {"from": 3, "to": 4}}, "When we got our food, the waitress barely said a word as she placed our take-out on the table and grabbed the check.": {"take-out": {"from": 16, "to": 18}}, "That, the Peruvian style rotisserie chicken (get a whole one) and a side dish plus don't forget - chicha moradas: a refreshing non-alcoholic drink made from boiled purple corn and lime juice with tiny pear cubes and a bit of sugar.": {"non-alcoholic drink": {"from": 27, "to": 29}}, "We had reserved space one one side of the bar, but when the staff tried to force the Pre-Fixe on all 15 members of the party to stay there, we moved to the other side (the difference in decor was minimal).": {"Pre-Fixe": {"from": 19, "to": 20}}, "A dining beacon in an otherwise residential 4 or 5 block radius, Sorrel pleases on every course--from the cold spicy tomato soup and beet salad starters to the delectable skate, the scallops, or steak tartare, straight through to the strange but tasty melon soup or flan-esque orange-and-caramel custard (so bad with names).": {"orange-and-caramel": {"from": 54, "to": 58}}, "Sometimes, the take-out and seating lines can be long, but the staff help move things along.": {"take-out": {"from": 3, "to": 5}}, "As soon as he sat, a waiter came over not once but twice, the first time to suggest he move to the bar b/c our large booth didn't accomodate an extra person, the second time to insist he move.": {"bar b/c": {"from": 24, "to": 25}}, "A dish of chewy smoked seitan evokes Peking duck, while an entree of wide green-tea noodles is served in a tasty faux Bolognese sauce.": {"wide green-tea noodles": {"from": 14, "to": 18}}, "Though weekend nights and Sunday brunch draw the largest crowds, neighborhood residents master this vegan menu of quinoa-lentil cakes, seitan piccata, and sweet-potato pumpkin pie by popping in daily.": {"quinoa-lentil cakes": {"from": 18, "to": 20}}, "Binegar, soy sauce, pish sauce, garLIC, ginger, chicken, lechon, oh man, it was sooooooooooooooooooooooooooooooo good.": {"garLIC, ginger, chicken": {"from": 8, "to": 13}}, "Don't bother looking at a menu- Shrimp cocktail, steak for 1,2,3, or more, creamed spinach and hash browns, and save room for the pecan pie and cheese cake, and don't forget the SCHLAG!!!!": {"menu- Shrimp cocktail": {"from": 6, "to": 9}}, "Only quibbles are so-so wine service, and while Prix-fixe is reasonable at $68, extra charges for additional dishes/tastings can be high.": {"Prix-fixe": {"from": 10, "to": 12}}, "The dinner menu promises creative-yet-comforting fare, such as beef brisket in a red wine and fig sauce, panko-crusted tofu over hijiki salad, and a six-spice beef burger.": {"six-spice beef burger": {"from": 32, "to": 36}}, "I've only had take-out from here but a couple of their dishes, along with the spicy green and orange sauces, are amazing.": {"take-out": {"from": 4, "to": 6}}, "Recently a seafood dish was so salty that that one flaw overshadowed otherwise excellent 'side' dishes, apps desert.": {"'side' dishes": {"from": 14, "to": 17}}, "This is a don't miss if you are anywhere close to the area, but if you're going for lunch, be there by noon to avoid a wait.": {"are a": {"from": 8, "to": 9}}, "The Food There's a Mediterranean bent to the menu--hummus, babaganoush and stuffed grape leaves are offered, as well as Moroccan chicken and spicy Merguez lamb sausage.": {"menu": {"from": 9, "to": 9}}, "Pastas include shellfish-stocked linguine with tomato sauce, and an excellent homemade cheese ravioli--all are available in half portions.": {"homemade cheese ravioli": {"from": 13, "to": 15}}, "The Food The French-Belgian menu is small, and everything on it is satisfyingly savory, such as a simple pot of mussels in a choice of sauces (beer and bacon, creamy mushroom, or white wine-and-garlic broth); beef stewed with beer and prunes; and a juicy croque monsieur.": {"white wine-and-garlic broth": {"from": 39, "to": 45}}, "This place is the tourist fav of chinese food in the city, the service was fast, but the taste of the food is average, too much starch used in dishes, and the flavors of different dishes are very similar, can't really tell the difference.": {"the food": {"from": 22, "to": 23}}, "I wasn't impressed by dessert - I ordered truffles w/ bisquits.": {"w/ bisquits": {"from": 10, "to": 11}}, "Save room for extra sides, even though two come with each main course: The collard greens, gooey mac and cheese and ham-hocked lima beans all stoke the soul like the sound of a pedal-steel guitar.": {"ham-hocked lima beans": {"from": 24, "to": 26}}, "When you feel like eating again an hour later (portions are small) at least you won't feel as regretful about ordering take-out.": {"take-out": {"from": 24, "to": 26}}, "There was interesting summer dessert, a rubarb-crisp with basil ice cream.": {"rubarb-crisp with basil ice cream": {"from": 7, "to": 11}}, "Affordable starters comprise most of the menu: Cheese plates with sweet-sour chutneys, spicy lamb-stuffed fried olives and plump mussels baked under saffron-herb breadcrumbs are addictive, but signature tigelle panini fixings shouldn't be missed.": {"lamb-stuffed fried olives": {"from": 17, "to": 20}}, "The Food This Cajun-Italian menu is lengthier than its Manhattan counterparts--here, adventuresome diners can still design their own pies, but they can also feast on oversized plates of peel-and-eat old bay shrimp and cajun spaghetti with meatballs enlivened with andouille sausage.": {"Cajun-Italian menu": {"from": 3, "to": 5}}, "In summary: a terribly obnoxious and impolite host, a long and cramped wait for a table (complete with a mediocre bartender and drinks), more bad host, a calamari appetizer that may have actually been a joke, an hour's wait for our entrees, and tough chop-away-at-it veal.": {"chop-away-at-it veal": {"from": 53, "to": 59}}, "Our server lamely offered a free after-dinner drink to make up for it after he failed to even ask how the food was once it was served.": {"after-dinner drink": {"from": 6, "to": 7}}, "as appetizers, we ordered the zucchini flowers (rich savory) escargot-topped mushroom caps (mediocre).": {"escargot-topped mushroom": {"from": 12, "to": 14}}, "Meals generally begin in a pub-food vein, with appetizers like featherweight, perfectly salted fried clams and brown sugar-lacquered ribs that are good enough to take on any barbecue joint in the city.": {"brown sugar-lacquered ribs": {"from": 18, "to": 22}}, "For dinner I order linguine w/ red clam sauce, the pasta was perfect and the sauce was flavorful but the clams tasted funny so I ate around them.": {"w/ red clam sauce": {"from": 5, "to": 8}}, "it is a small take-out style restuarant but they have a few tables.": {"take-out": {"from": 4, "to": 6}}, "The Food The French-Belgian menu is small, but everything on it is satisfyingly savory, from a simple pot of mussels in a choice of sauces (beer and bacon, creamy mushroom, or white wine and garlic broth), to beef stewed with beer and prunes; from a juicy croque monsieur and beyond.": {"French-Belgian menu": {"from": 3, "to": 6}}, "Although the tables may be closely situated, the candle-light, food-quality and service overcompensate.": {"food-quality": {"from": 13, "to": 15}}}