{"The atmosphere was crowded but it was a great bistro-type vibe.": {"bistro-type vibe": {"from": 9, "to": 11}}, "We were still sitting at the bar while we drank the sangria, but facing away from the bar when we turned back around, the $2 was gone the people next to us said the bartender took it.": {"bar": {"from": 18, "to": 18}}, "It costs $2 extra to turn a regular roll into an inside-out roll, but the roll more than triples in size, and that's not just from the rice.": {"roll": {"from": 15, "to": 15}}, "Food-awesome.": {"Food": {"from": 0, "to": 0}}, "So much more than the usual bar food, go there to enjoy the menu while sampling one of their hand-crafted beers.": {"hand-crafted beers": {"from": 20, "to": 23}}, "Fluke sashimi drizzled with jalapeno-lime olive oil, the fruit of the oil nicely highlighting the fish's sweetness.": {"jalapeno-lime olive oil": {"from": 4, "to": 7}}, "Although the tables may be closely situated, the candle-light, food-quality and service overcompensate.": {"food-quality": {"from": 13, "to": 15}}, "The pesto pizza was excellent, thin-crust pizza with a nice amount of spicy Italian cheese that I'd never heard of before.": {"thin-crust pizza": {"from": 6, "to": 8}}, "The food can get pricey but the prixe fixe tasting menu is the greatest food for a good price and they cater the food to any food allergies or food you don't like.": {"food": {"from": 26, "to": 26}}, "We all ate pasta entre'es, which were great.": {"pasta entre'es": {"from": 3, "to": 4}}, "Don't dine at Tamarind for the vegetarian dishes, they are simply not up to par with the non-veg selections.": {"non-veg selections": {"from": 19, "to": 20}}, "I've had the chicken with garlic sauce, chicken with black bean sauce, and hunan chicken.": {"chicken with black bean sauce": {"from": 9, "to": 13}}, "The in-house lady DJ on Saturday nights has outrageously good taste in music, and moreover, takes requests.": {"in-house lady DJ": {"from": 1, "to": 4}}, "Try the Pad Se-Ew or Chicken with Cashew Nuts for a memorable and repeatable experience.": {"Pad Se-Ew": {"from": 2, "to": 5}}}