{"I think part of the problem with this computer is Vista, yet I know Vista isn't the entire issue because my latest purchase was my Acer and it also has Vista (I should have waited the few months to get the next operating system).": {"Vista": {"from": 15, "to": 15}}, "Finally, I should note that I took the 2GB RAM stick from my old EeePC and installed it before I even powered on for the first time.": {"2GB RAM stick": {"from": 9, "to": 12}}, "With the macbook pro it comes with freesecuritysoftware to protect it from viruses and other intrusive things from downloads and internet surfing or emails.": {"securitysoftware": {"from": 7, "to": 7}}, "The Apple applications (ex.iPhoto) are fun, easy, and really cool to use (unlike the competition)!": {"iPhoto": {"from": 5, "to": 5}}, "I paid for extra memory and the 17-inch screen, as well as the top of the line DVD and CD burners.": {"17-inch screen": {"from": 7, "to": 10}}, "The flaws are, this computer is not for computer gamers because of the OS X.": {"OS X": {"from": 14, "to": 15}}, "the headphone and mic jack are in front of touch-pad making the touch-pad hard to use when using headphones/mic, not to mention the laptop was designed for right handed person.": {"touch-pad": {"from": 14, "to": 16}}, "I bought this last week, and the very next day had to return it because it over heated and the touch-mouse stopped responding.": {"touch-mouse": {"from": 21, "to": 23}}, "Unless you need the Bluetooth 3.": {"Bluetooth 3": {"from": 4, "to": 5}}, "/ awesome cooling system/ much better grafics card (ATI 5870) / 8GB RAM/ LED backlit screen...": {"8GB RAM": {"from": 14, "to": 16}}, "  Now I had not tried to use this since the disc drive had been replaced and after taking it back to the Geek Squad I found out they had accidently not used the right drive when they replaced the first one, so back it went to get the correct drive.": {"drive": {"from": 34, "to": 34}}, "-4 RAM slots, 2 HDD Bays*, 16GB RAM support -No Wireless Issues, at least for me.": {"16GB RAM support": {"from": 9, "to": 12}}, "So what am I supposed to do?  The LG service center cannot provide me the \"service\" when it is called the \"service center\".": {"service": {"from": 18, "to": 18}}, "The battery life was supposed to be 6 hours, but even if I ran off the battery with the high effeciency setting the battery would only last me on average about 2.5 to 3 hours.": {"battery": {"from": 17, "to": 17}}, "  And at one point, they blame me for installing a bad memory stick when I upgrade my memory for the first time during my purchase of the laptop (I bought the memory stick they recomended).": {"memory": {"from": 18, "to": 18}}, "-Bluetooth (2.1), Fingerprint Reader, Full 1920x1080 screen -Integrated Mic/Webcam* -Dual touchpad mode is interesting, and easy to use -5 USB ports -Runs about 38-41C on idle, Up to 65 (for me) on load -Very quiet -I could go on and on.": {"Bluetooth": {"from": 0, "to": 0}}, "This is an over-sized, 18-inch laptop.": {"18-inch": {"from": 5, "to": 7}}, "Strengths:Well-shaped Weaknesses:A bad videocard!": {"shaped": {"from": 3, "to": 3}}, "But the machine is awesome and iLife is great and I love Snow Leopard X.": {"Snow Leopard X": {"from": 12, "to": 14}}, "This laptop looks great on the surface: 17\" inch screen, good  price-point, nice appearance, boots up quickly, runs fast etc.": {"price-point": {"from": 14, "to": 16}}, "The Mac Snow Leopard O/S is extremely easy to use, although very different than Win XP, Visa or Win7.": {"Mac Snow Leopard O/S": {"from": 1, "to": 4}}}